const weaponsData = [
    { 
        name: "Понос немощи", 
        primary: ["Жидкий огонь", "трунь-трунь", "Максим"], 
        secondary: ["Хуй двигателя", "Камшот", "Бых"] 
    },
    { 
        name: "Женя", 
        primary: ["Полугей", "Фулл гей", "Чпоньк"], 
        secondary: ["Камшот", "Разрядка", "Тугой выстрел жопы"] 
    },
    { 
        name: "Чайник", 
        primary: ["Электрический хух", "Зарядный хых", "Тостер в ванной"], 
        secondary: ["Севший вибратор", "Заряженный вибратор", "Суставы болят"] 
    },
    { 
        name: "Револьвер питерского интеллегента", 
        primary: ["Полугей", "Трунь-трунь", "Негр"], 
        secondary: ["!Автоваз", "Солевой глаз", "Пароварка"] 
    },
    { 
        name: "Фризби", 
        primary: ["Автоматика", "Динамо", "Огненный веер"], 
        secondary: ["Инфернальные диски", "Электронные проводники", "Найти и уничтожить"] 
    },
    { 
        name: "Лук", 
        primary: ["В яблочко", "Пронзание", "Круговорот стрел"], 
        secondary: ["Многозарядный", "Умная стрела", "Взрывная стрела"] 
    },
    { 
        name: "Плазменная установка", 
        primary: ["Полуавтомат", "Зенитная установка", "Искатели"], 
        secondary: ["Луч дезинтеграции", "Инфузия пустоты", "Клейкий состав"] 
    },
    { 
        name: "Бог рыб", 
        primary: ["Плевок рыбьей ярости", "Стремительная жижа", "Опасная жижа"], 
        secondary: ["Призыв", "Щит", "Хвост"] 
    },
    { 
        name: "Гарпунное ружье", 
        primary: ["Пробивные гарпуны", "Отскакивающие гарпуны", "Цеп гарпуны"], 
        secondary: ["Гарпуны на рассоле", "Связывающие гарпуны", "Колючие гарпуны"] 
    }
];

const abilitiesData = ["Граната", "Древний куб", "Якорь", "Турель", "Поле рассола", "Копье"];

const aspectsData = ["Кровь", "Щит", "Огонь", "Золото", "Мороз", "Электричество", "Тень", "Море", "Дух", "Ветер"];