const weaponsData = [
    { 
        name: "Винтовка мощи", 
        primary: ["Автоматический огонь", "Вспыхнувший Огонь", "Огонь по Гатлингу"], 
        secondary: ["Обороты двигателя", "Разделенный Снимок", "Концентрированный Выстрел"] 
    },
    { 
        name: "Дробовик", 
        primary: ["Дробь", "Широкий выстрел", "Картечь"], 
        secondary: ["Прицельный", "Удар прикладом", "Перезарядка"] 
    },
    { 
        name: "Тесла пушка", 
        primary: ["Разряд", "Цепь", "Импульс"], 
        secondary: ["ЭМИ", "Зарядка", "Перегрузка"] 
    },
    { 
        name: "Револьвер", 
        primary: ["Быстрый выстрел", "Точный выстрел", "Шесть пуль"], 
        secondary: ["Ковбойский", "Перекат", "Вращение"] 
    },
    { 
        name: "Метатель дисков", 
        primary: ["Бросок", "Рикошет", "Вихрь"], 
        secondary: ["Ловушка", "Возврат", "Ускорение"] 
    },
    { 
        name: "Лук", 
        primary: ["Стрела", "Залп", "Прицел"], 
        secondary: ["Откат", "Ближний бой", "Уклонение"] 
    },
    { 
        name: "Плазменная установка", 
        primary: ["Плазма", "Сгусток", "Волна"], 
        secondary: ["Стазис", "Подрыв", "Заряд"] 
    },
    { 
        name: "Бог рыб", 
        primary: ["Рыба", "Водяной смерч", "Чешуя"], 
        secondary: ["Призыв", "Щит", "Хвост"] 
    },
    { 
        name: "Гарпунное ружье", 
        primary: ["Гарпун", "Трос", "Взрыв"], 
        secondary: ["Вытягивание", "Цепь", "Бросок"] 
    }
];

const abilitiesData = ["Граната", "Древний куб", "Якорь", "Турель", "Поле рассола", "Копье"];

const aspectsData = ["Кровь", "Щит", "Огонь", "Золото", "Мороз", "Электричество", "Тень", "Море", "Дух", "Ветер"];